ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/eusci_a.xml
<module id="eUSCI_A" HW_revision=""><register id="CTLW0" width="16" offset="0x0" internal="0" description="eUSCI_Ax Control Word Register 0"><bitfield id="SWRST" description="Software reset enable" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="SWRST__0" value="0" description="Disabled. eUSCI_A reset released for operation"/><bitenum id="SWRST__1" value="1" description="Enabled. eUSCI_A logic held in reset state"/></bitfield><bitfield id="TXBRK" description="Transmit break" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="TXBRK__0" value="0" description="Next frame transmitted is not a break"/><bitenum id="TXBRK__1" value="1" description="Next frame transmitted is a break or a break/synch"/></bitfield><bitfield id="TXADDR" description="Transmit address" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="TXADDR__0" value="0" description="Next frame transmitted is data"/><bitenum id="TXADDR__1" value="1" description="Next frame transmitted is an address"/></bitfield><bitfield id="DORM" description="Dormant. Puts eUSCI_A into sleep mode" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="DORM__0" value="0" description="Not dormant. All received characters set UCRXIFG."/><bitenum id="DORM__1" value="1" description="Dormant"/></bitfield><bitfield id="BRKIE" description="Receive break character interrupt enable" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="BRKIE__0" value="0" description="Received break characters do not set UCRXIFG"/><bitenum id="BRKIE__1" value="1" description="Received break characters set UCRXIFG"/></bitfield><bitfield id="RXEIE" description="Receive erroneous-character interrupt enable" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="RXEIE__0" value="0" description="Erroneous characters rejected and UCRXIFG is not set"/><bitenum id="RXEIE__1" value="1" description="Erroneous characters received set UCRXIFG"/></bitfield><bitfield id="SSEL" description="eUSCI_A clock source select" begin="7" end="6" width="2" rwaccess="R/W"><bitenum id="SSEL__0" value="0" description="UCLK"/><bitenum id="SSEL__1" value="1" description="ACLK"/><bitenum id="SSEL__2" value="2" description="SMCLK"/></bitfield><bitfield id="SYNC" description="Synchronous mode enable" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="SYNC__0" value="0" description="Asynchronous mode"/><bitenum id="SYNC__1" value="1" description="Synchronous mode"/></bitfield><bitfield id="MODE" description="eUSCI_A mode" begin="10" end="9" width="2" rwaccess="R/W"><bitenum id="MODE__0" value="0" description="UART mode"/><bitenum id="MODE__1" value="1" description="Idle-line multiprocessor mode"/><bitenum id="MODE__2" value="2" description="Address-bit multiprocessor mode"/><bitenum id="MODE__3" value="3" description="UART mode with automatic baud-rate detection"/></bitfield><bitfield id="SPB" description="Stop bit select. Number of stop bits." begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="SPB__0" value="0" description="One stop bit"/><bitenum id="SPB__1" value="1" description="Two stop bits"/></bitfield><bitfield id="7BIT" description="Character length. Selects 7-bit or 8-bit character length." begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="7BIT__0" value="0" description="8-bit data"/><bitenum id="7BIT__1" value="1" description="7-bit data"/></bitfield><bitfield id="MSB" description="MSB first select" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="MSB__0" value="0" description="LSB first"/><bitenum id="MSB__1" value="1" description="MSB first"/></bitfield><bitfield id="PAR" description="Parity select. UCPAR is not used when parity is disabled." begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="PAR__0" value="0" description="Odd parity"/><bitenum id="PAR__1" value="1" description="Even parity"/></bitfield><bitfield id="PEN" description="Parity enable" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="PEN__0" value="0" description="Parity disabled"/><bitenum id="PEN__1" value="1" description="Parity enabled"/></bitfield></register><register id="CTLW1" width="16" offset="0x2" internal="0" description="eUSCI_Ax Control Word Register 1"><bitfield id="GLIT" description="Deglitch time" begin="1" end="0" width="2" rwaccess="R/W"><bitenum id="GLIT__0" value="0" description="Approximately 2 ns (equivalent of 1 delay element)"/><bitenum id="GLIT__1" value="1" description="Approximately 50 ns"/><bitenum id="GLIT__2" value="2" description="Approximately 100 ns"/><bitenum id="GLIT__3" value="3" description="Approximately 200 ns"/></bitfield></register><register id="BRW" width="16" offset="0x6" internal="0" description="eUSCI_Ax Baud Rate Control Word Register"><bitfield id="BR" description="Clock prescaler setting of the Baud rate generator" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="MCTLW" width="16" offset="0x8" internal="0" description="eUSCI_Ax Modulation Control Word Register"><bitfield id="OS16" description="Oversampling mode enabled" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="OS16__0" value="0" description="Disabled"/><bitenum id="OS16__1" value="1" description="Enabled"/></bitfield><bitfield id="BRF" description="First modulation stage select" begin="7" end="4" width="4" rwaccess="R/W"/><bitfield id="BRS" description="Second modulation stage select" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="STATW" width="16" offset="0xA" internal="0" description="eUSCI_Ax Status Register"><bitfield id="BUSY" description="eUSCI_A busy" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="BUSY__0" value="0" description="eUSCI_A inactive"/><bitenum id="BUSY__1" value="1" description="eUSCI_A transmitting or receiving"/></bitfield><bitfield id="ADDR_IDLE" description="UCADDR: Address received in address-bit multiprocessor mode" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="RXERR" description="Receive error flag" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="RXERR__0" value="0" description="No receive errors detected"/><bitenum id="RXERR__1" value="1" description="Receive error detected"/></bitfield><bitfield id="BRK" description="Break detect flag. UCBRK is cleared when UCAxRXBUF is read." begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="BRK__0" value="0" description="No break condition"/><bitenum id="BRK__1" value="1" description="Break condition occurred"/></bitfield><bitfield id="PE" description="Parity error flag" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="PE__0" value="0" description="No error"/><bitenum id="PE__1" value="1" description="Character received with parity error"/></bitfield><bitfield id="OE" description="Overrun error flag" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="OE__0" value="0" description="No error"/><bitenum id="OE__1" value="1" description="Overrun error occurred"/></bitfield><bitfield id="FE" description="Framing error flag. UCFE is cleared when UCAxRXBUF is read." begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="FE__0" value="0" description="No error"/><bitenum id="FE__1" value="1" description="Character received with low stop bit"/></bitfield><bitfield id="LISTEN" description="Listen enable. The UCLISTEN bit selects loopback mode." begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="LISTEN__0" value="0" description="Disabled"/><bitenum id="LISTEN__1" value="1" description="Enabled. UCAxTXD is internally fed back to the receiver"/></bitfield></register><register id="RXBUF" width="16" offset="0xC" internal="0" description="eUSCI_Ax Receive Buffer Register"><bitfield id="RXBUF" description="The receive-data buffer is user accessible and contains the las" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="TXBUF" width="16" offset="0xE" internal="0" description="eUSCI_Ax Transmit Buffer Register"><bitfield id="TXBUF" description="The transmit data buffer is user accessible and holds the data " begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="ABCTL" width="16" offset="0x10" internal="0" description="eUSCI_Ax Auto Baud Rate Control Register"><bitfield id="ABDEN" description="Automatic baud-rate detect enable" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ABDEN__0" value="0" description="Baud-rate detection disabled"/><bitenum id="ABDEN__1" value="1" description="Baud-rate detection enabled"/></bitfield><bitfield id="BTOE" description="Break time out error" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="BTOE__0" value="0" description="No error"/><bitenum id="BTOE__1" value="1" description="Length of break field exceeded 22 bit times"/></bitfield><bitfield id="STOE" description="Synch field time out error" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="STOE__0" value="0" description="No error"/><bitenum id="STOE__1" value="1" description="Length of synch field exceeded measurable time"/></bitfield><bitfield id="DELIM" description="Break/synch delimiter length" begin="5" end="4" width="2" rwaccess="R/W"><bitenum id="DELIM__0" value="0" description="1 bit time"/><bitenum id="DELIM__1" value="1" description="2 bit times"/><bitenum id="DELIM__2" value="2" description="3 bit times"/><bitenum id="DELIM__3" value="3" description="4 bit times"/></bitfield></register><register id="IRCTL" width="16" offset="0x12" internal="0" description="eUSCI_Ax IrDA Control Word Register"><bitfield id="IREN" description="IrDA encoder/decoder enable" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="IREN__0" value="0" description="IrDA encoder/decoder disabled"/><bitenum id="IREN__1" value="1" description="IrDA encoder/decoder enabled"/></bitfield><bitfield id="IRTXCLK" description="IrDA transmit pulse clock select" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="IRTXCLK__0" value="0" description="BRCLK"/><bitenum id="IRTXCLK__1" value="1" description="BITCLK16 when UCOS16 = 1. Otherwise, BRCLK."/></bitfield><bitfield id="IRTXPL" description="Transmit pulse length" begin="7" end="2" width="6" rwaccess="R/W"/><bitfield id="IRRXFE" description="IrDA receive filter enabled" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="IRRXFE__0" value="0" description="Receive filter disabled"/><bitenum id="IRRXFE__1" value="1" description="Receive filter enabled"/></bitfield><bitfield id="IRRXPL" description="IrDA receive input UCAxRXD polarity" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="IRRXPL__0" value="0" description="IrDA transceiver delivers a high pulse when a light pulse is se"/><bitenum id="IRRXPL__1" value="1" description="IrDA transceiver delivers a low pulse when a light pulse is seen"/></bitfield><bitfield id="IRRXFL" description="Receive filter length" begin="13" end="10" width="4" rwaccess="R/W"/></register><register id="IE" width="16" offset="0x1A" internal="0" description="eUSCI_Ax Interrupt Enable Register"><bitfield id="RXIE" description="Receive interrupt enable" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="RXIE__0" value="0" description="Interrupt disabled"/><bitenum id="RXIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="TXIE" description="Transmit interrupt enable" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="TXIE__0" value="0" description="Interrupt disabled"/><bitenum id="TXIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="STTIE" description="Start bit interrupt enable" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="STTIE__0" value="0" description="Interrupt disabled"/><bitenum id="STTIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="TXCPTIE" description="Transmit complete interrupt enable" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="TXCPTIE__0" value="0" description="Interrupt disabled"/><bitenum id="TXCPTIE__1" value="1" description="Interrupt enabled"/></bitfield></register><register id="IFG" width="16" offset="0x1C" internal="0" description="eUSCI_Ax Interrupt Flag Register"><bitfield id="RXIFG" description="Receive interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="RXIFG__0" value="0" description="No interrupt pending"/><bitenum id="RXIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="TXIFG" description="Transmit interrupt flag. UCTXIFG is set when UCAxTXBUF empty." begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="TXIFG__0" value="0" description="No interrupt pending"/><bitenum id="TXIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="STTIFG" description="Start bit interrupt flag" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="STTIFG__0" value="0" description="No interrupt pending"/><bitenum id="STTIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="TXCPTIFG" description="Transmit ready interrupt enable" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="TXCPTIFG__0" value="0" description="No interrupt pending"/><bitenum id="TXCPTIFG__1" value="1" description="Interrupt pending"/></bitfield></register><register id="IV" width="16" offset="0x1E" internal="0" description="eUSCI_Ax Interrupt Vector Register"><bitfield id="IV" description="eUSCI_A interrupt vector value" begin="15" end="0" width="16" rwaccess="R/W"><bitenum id="IV__0" value="0" description="No interrupt pending"/><bitenum id="IV__2" value="2" description="Interrupt Source: Receive buffer full; Interrupt Flag: UCRXIFG;"/><bitenum id="IV__4" value="4" description="Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG"/><bitenum id="IV__6" value="6" description="Interrupt Source: Start bit received; Interrupt Flag: UCSTTIFG"/><bitenum id="IV__8" value="8" description="Interrupt Source: Transmit complete; Interrupt Flag: UCTXCPTIFG"/></bitfield></register></module>